Project/app/controllers/users/omniauth_callbacks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "cambone750@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "cambone750@gmail.com"], ["LIMIT", 1]]
---
    def google_oauth2
      auth = request.env['omniauth.auth']
    # Find or create the user by email
    @user = User.find_or_initialize_by(email: auth.info.email)
    @user.username = request.env["omniauth.auth"].info.name if @user.username.blank?