Project/app/controllers/comments_controller.rb

    def create
        @game = Game.find(params[:game_id])
        @comment = @game.comments.create(comment_params)
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "game_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "dscscdcs"], ["body", "sdcscdscsc"], ["game_id", 7], ["created_at", "2023-08-01 09:32:38.685706"], ["updated_at", "2023-08-01 09:32:38.685706"], ["status", "public"]]

      def destroy
        @game = Game.find(params[:game_id])
        @comment = @game.comments.find(params[:id])
        @comment.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."game_id" = ? AND "comments"."id" = ? LIMIT ?  [["game_id", 7], ["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]