Project/app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @game = Game.find(params[:id])

INSERT INTO "games" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Videogioco"], ["body", "super divertente"], ["created_at", "2023-08-01 09:46:44.147903"], ["updated_at", "2023-08-01 09:46:44.147903"], ["status", "public"]]
---
  def create
    @game = Game.new(game_params)
    if @game.save

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @game = Game.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "games" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["title", "Altro titolo"], ["body", "Bodyrfwfwcrcsc"], ["updated_at", "2023-08-01 08:48:14.451688"], ["id", 3]]
---
  def update
    @game = Game.find(params[:id])
    if @game.update(game_params)

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]
---
  def destroy
    @game = Game.find(params[:id])
    @game.destroy