Project/app/models/user.rb

  def self.from_omniauth(auth)
    where(auth.slice(:provider, :uid)).first_or_create do |user|
---
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT ?  [["provider", "google_oauth2"], ["uid", "111256734616843424514"], ["LIMIT", 1]]